jwt-auth/server/app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "vidhi03"], ["LIMIT", 1]]
---
    def log_in
#     fetch('this route')
#       {name email password}
#
        #find user with name
        user = User.find_by(name: params[:username])