jwt-auth/server/app/controllers/application_controller.rb

    def logged_in?
        headers = request.headers["Authorization"] # "Bearer token"
        token = headers.split(" ")[1]
        user_id = JWT.decode(token, "TexasDC")[0]["user_id"]
        user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]